Autodesk.Revit.DB.DisplacementPath.SetAnchorPoint(Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference,System.Double)
Sets the reference that determines the origin of this DisplacementPath.
displacementElement:
The element id of a DisplacementElement.
reference:
A reference of an edge or a curve in the GRep of the element corresponding to elemId.
param:
An parameter used to specify a point on the edge.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The value param should lie in the range [0,1].
-or-
reference does not represent an edge or curve belonging to an element displaced by displacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementPath.IsValidReference(Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference)
Does the specified pick represent an edge or a curve belonging to one of the displaced elements.
displacementElement:
A DisplacementElement.
reference:
A pick.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementPath.IsValidParam(System.Double)
Is the specified value a valid edge or curve parameter.
param:
proposed edge parameter.
Since:
2014

Autodesk.Revit.DB.DisplacementPath.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference,System.Double)
Creates a new DisplacementPath referencing a DisplacementElement and edge or curve and adds it to the document.
aDoc:
The document.
displacementElement:
Element id of a DisplacementElement
reference:
A reference that refers to an edge or curve of one of the elements displaced by the displacementElement.
param:
A value in the range [0,1]. It will be interpreted as a parameter for the specified edge.
Returns:
The element id of the newly created DisplacementPath.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The value param should lie in the range [0,1].
-or-
reference does not represent an edge or curve belonging to an element displaced by displacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementPath.PathStyle
Specifies the style of the path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.DisplacementPath.AncestorIdx
Specifies the end point of the path.
Since:
2014

Autodesk.Revit.DB.DisplacementPath
A view-specific annotation related to a DisplacementElement.
Remarks:
The DisplacementPath is anchored to the DisplacementElement by a reference to a point
on an edge of a source element of the DisplacementElement. It is
represented by a single line, or a series of jogged lines, originating at the specified point
on the displaced element.
The associated DisplacementElement may have a parent DisplacementElement and this parent may have its own parent DisplacementElement,
producing a series of ancestors. The terminal point may be the point's original (un-displaced)
location, or the corresponding point on any of the intermediate displaced locations corresponding
to these ancestor DisplacementElements.
Since:
2014